export default {
  name: '码上掘金游戏精选',
  url: 'https://games.jcode.pub',
  collection: [
    {
      type: 'folder',
      folded: false,
      name: '益智游戏',
      collection: [
        {name: '消除方块', author: '十年踪迹', id: '7132120696733302822', default: true},
        {name: '推箱子', author: '十年踪迹', id: '7131587018592796679'},
        {name: '🤖 manufactoria', author: '十年踪迹', id: '7161659797224292365'},
        {name: '扫雷', author: '大胆的番茄', id: '7159386844486959118'},
        {name: '2048', author: '小创不才', id: '7157941983531499534'},
        {name: '数字消除', author: '彩云归', id: '7129693096253587486'},
        {name: '数独游戏', author: '心如止水', id: '7086356547647275049'},
        {name: '数字华容道', author: '_风满楼', id: '7158450860962349087'},
        {name: '十二生肖消一消', author: '3065906567846141', id: '7158392331622842383'},
        {name: 'horrible-game', author: 'pegasus64', id: '7163673508373856296'},
      ],
    }, {
      type: 'folder',
      folded: false,
      name: '棋类游戏',
      collection: [
        {name: '黑白棋', author: '十年踪迹', id: '7156782077285761024'},
        {name: 'AI 五子棋', author: 'WebW0rld', id: '7121490956636913694'},
        {name: '中国象棋', author: 'Aaaaaaaaaaayou', id: '7159467834496516132'},
      ],
    }, {
      type: 'folder',
      folded: false,
      name: '动作游戏',
      collection: [
        {name: 'Platformer', author: '十年踪迹', id: '7132404229280366606'},
        {name: '贪吃蛇', author: '法医', id: '7155823946388996132'},
        {name: '贪食蛇', author: '大胆的番茄', id: '7159384232266039310'},
        {name: '红蓝打砖块', author: 'jsmask', id: '7155040400577658891'},
        {name: 'Canvas打球游戏', author: 'WebW0rld', id: '7142285713172594724'},
        {name: '别碰到球', author: 'Ziu', id: '7154351544446484494'},
        {name: '吃豆人', author: 'passer-by6061', id: '7159784253343924254'},
        {name: '飞机大战', author: '2779985582767421', id: '7160317661635674146'},
        {name: '💩到临头', author: 'JingZaia', id: '7160217341429710855'},
        {name: '大乱斗', author: '清1024', id: '7163113821949657103'},
        {name: '乒乓球', author: 'wangpeng1478', id: '7163855731035209743'},
        {name: '炸弹人', author: '垃圾猿', id: '7162350895340978189'},
      ],
    }
  ],
};
